Revit 2027 API
ViewSheet.GetAllViewports Method
 Returns the ElementIds of Viewports on this sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetAllViewports()
Public Function GetAllViewports As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetAllViewports()
member GetAllViewports : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The Viewports on this sheet.
Remarks
 Schedules on the sheet are not returned by this method. Use ScheduleSheetInstance.OwnerViewId to find the sheet on which a schedule is placed.
See Also
Reference
ViewSheet Class
Autodesk.Revit.DB Namespace